Тестовая_база_ERP_14/src/AccumulationRegisters/ПланыПотребленияМатериалов/ПланыПотребленияМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыПотребленияМатериалов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаЕдиницуПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержитРасчетноеКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииТоварногоПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПланов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеДиспетчер</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланПроизводства</name>
    <type>
      <types>DocumentRef.ПланПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоПолуфабрикат</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьДатаВыпускаПолуфабриката</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСпецификацияПолуфабриката</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПродукции</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеПродукции</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/AccumulationRegisters/ПланыПотребленияМатериалов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список полуфабрикатов/продукции, потреблеющих заданный полуфабрикат.
//
// Параметры:
//  Полуфабрикат - Структура - параметры полуфабриката.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - данные о потребителях полуфабриката.
//
Функция ПотребителиПолуфабриката(Полуфабрикат) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланыПотребленияМатериалов.Сценарий КАК Сценарий,
		|	ПланыПотребленияМатериалов.Статус КАК Статус,
		|	ПланыПотребленияМатериалов.НоменклатураПродукции КАК Номенклатура,
		|	ПланыПотребленияМатериалов.ХарактеристикаПродукции КАК Характеристика,
		|	ПланыПотребленияМатериалов.ПодразделениеДиспетчер КАК Подразделение,
		|	ПланыПотребленияМатериалов.ПланПроизводства КАК ПланПроизводства,
		|	ПланыПотребленияМатериалов.Спецификация КАК Спецификация,
		|	ПланыПотребленияМатериалов.НазначениеПродукции КАК Назначение,
		|	ПланыПотребленияМатериалов.ДатаПроизводства КАК Период
		|ИЗ
		|	РегистрНакопления.ПланыПотребленияМатериалов КАК ПланыПотребленияМатериалов
		|ГДЕ
		|	ПланыПотребленияМатериалов.Сценарий = &Сценарий
		|	И ПланыПотребленияМатериалов.Статус = &Статус
		|	И ПланыПотребленияМатериалов.Номенклатура = &Номенклатура
		|	И ПланыПотребленияМатериалов.Характеристика = &Характеристика
		|	И ПланыПотребленияМатериалов.Назначение = &Назначение
		|	И ПланыПотребленияМатериалов.ПодразделениеДиспетчер = &Подразделение
		|	И ПланыПотребленияМатериалов.ПланПроизводства = &ПланПроизводства
		|	И ПланыПотребленияМатериалов.Период = &ДатаВыпускаПолуфабриката
		|	И ПланыПотребленияМатериалов.ЭтоПолуфабрикат = ИСТИНА");
	
	Запрос.УстановитьПараметр("Сценарий", Полуфабрикат.Сценарий);
	Запрос.УстановитьПараметр("Статус", Полуфабрикат.Статус);
	Запрос.УстановитьПараметр("Номенклатура", Полуфабрикат.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Полуфабрикат.Характеристика);
	Запрос.УстановитьПараметр("Назначение", Полуфабрикат.Назначение);
	Запрос.УстановитьПараметр("Подразделение", Полуфабрикат.Подразделение);
	Запрос.УстановитьПараметр("ПланПроизводства", Полуфабрикат.ПланПроизводства);
	Запрос.УстановитьПараметр("ДатаВыпускаПолуфабриката", Полуфабрикат.ДатаВыпускаПолуфабриката);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли
